Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.0.33/saml21a1/include/component/tcc.h
/* DITH5 mode */
#define TCC_CC_DITH5_DITHER_Pos               _U_(0)                                               /**< (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH5_DITHER_Msk               (_U_(0x1F) << TCC_CC_DITH5_DITHER_Pos)               /**< (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH5_DITHER(value)            (TCC_CC_DITH5_DITHER_Msk & ((value) << TCC_CC_DITH5_DITHER_Pos))
#define TCC_CC_DITH5_CC_Pos                   _U_(5)                                               /**< (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH5_CC_Msk                   (_U_(0x7FFFF) << TCC_CC_DITH5_CC_Pos)                /**< (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_DITH5_CC(value)                (TCC_CC_DITH5_CC_Msk & ((value) << TCC_CC_DITH5_CC_Pos))
#define TCC_CC_DITH5_Msk                      _U_(0x00FFFFFF)                                       /**< (TCC_CC_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_CC_DITH6_DITHER_Pos               _U_(0)                                               /**< (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH6_DITHER_Msk               (_U_(0x3F) << TCC_CC_DITH6_DITHER_Pos)               /**< (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH6_DITHER(value)            (TCC_CC_DITH6_DITHER_Msk & ((value) << TCC_CC_DITH6_DITHER_Pos))
#define TCC_CC_DITH6_CC_Pos                   _U_(6)                                               /**< (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH6_CC_Msk                   (_U_(0x3FFFF) << TCC_CC_DITH6_CC_Pos)                /**< (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_DITH6_CC(value)                (TCC_CC_DITH6_CC_Msk & ((value) << TCC_CC_DITH6_CC_Pos))
#define TCC_CC_DITH6_Msk                      _U_(0x00FFFFFF)                                       /**< (TCC_CC_DITH6) Register Mask  */


/* -------- TCC_PATTBUF : (TCC Offset: 0x64) (R/W 16) Pattern Buffer -------- */
#define TCC_PATTBUF_RESETVALUE                _U_(0x00)                                            /**<  (TCC_PATTBUF) Pattern Buffer  Reset Value */

#define TCC_PATTBUF_PGEB0_Pos                 _U_(0)                                               /**< (TCC_PATTBUF) Pattern Generator 0 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB0_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB0_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 0 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB0(value)              (TCC_PATTBUF_PGEB0_Msk & ((value) << TCC_PATTBUF_PGEB0_Pos))
#define TCC_PATTBUF_PGEB1_Pos                 _U_(1)                                               /**< (TCC_PATTBUF) Pattern Generator 1 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB1_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB1_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 1 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB1(value)              (TCC_PATTBUF_PGEB1_Msk & ((value) << TCC_PATTBUF_PGEB1_Pos))
#define TCC_PATTBUF_PGEB2_Pos                 _U_(2)                                               /**< (TCC_PATTBUF) Pattern Generator 2 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB2_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB2_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 2 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB2(value)              (TCC_PATTBUF_PGEB2_Msk & ((value) << TCC_PATTBUF_PGEB2_Pos))
#define TCC_PATTBUF_PGEB3_Pos                 _U_(3)                                               /**< (TCC_PATTBUF) Pattern Generator 3 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB3_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB3_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 3 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB3(value)              (TCC_PATTBUF_PGEB3_Msk & ((value) << TCC_PATTBUF_PGEB3_Pos))
#define TCC_PATTBUF_PGEB4_Pos                 _U_(4)                                               /**< (TCC_PATTBUF) Pattern Generator 4 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB4_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB4_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 4 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB4(value)              (TCC_PATTBUF_PGEB4_Msk & ((value) << TCC_PATTBUF_PGEB4_Pos))
#define TCC_PATTBUF_PGEB5_Pos                 _U_(5)                                               /**< (TCC_PATTBUF) Pattern Generator 5 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB5_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB5_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 5 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB5(value)              (TCC_PATTBUF_PGEB5_Msk & ((value) << TCC_PATTBUF_PGEB5_Pos))
#define TCC_PATTBUF_PGEB6_Pos                 _U_(6)                                               /**< (TCC_PATTBUF) Pattern Generator 6 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB6_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB6_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 6 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB6(value)              (TCC_PATTBUF_PGEB6_Msk & ((value) << TCC_PATTBUF_PGEB6_Pos))
#define TCC_PATTBUF_PGEB7_Pos                 _U_(7)                                               /**< (TCC_PATTBUF) Pattern Generator 7 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB7_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB7_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 7 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB7(value)              (TCC_PATTBUF_PGEB7_Msk & ((value) << TCC_PATTBUF_PGEB7_Pos))
#define TCC_PATTBUF_PGVB0_Pos                 _U_(8)                                               /**< (TCC_PATTBUF) Pattern Generator 0 Output Enable Position */
#define TCC_PATTBUF_PGVB0_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB0_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 0 Output Enable Mask */
#define TCC_PATTBUF_PGVB0(value)              (TCC_PATTBUF_PGVB0_Msk & ((value) << TCC_PATTBUF_PGVB0_Pos))
#define TCC_PATTBUF_PGVB1_Pos                 _U_(9)                                               /**< (TCC_PATTBUF) Pattern Generator 1 Output Enable Position */
#define TCC_PATTBUF_PGVB1_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB1_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 1 Output Enable Mask */
#define TCC_PATTBUF_PGVB1(value)              (TCC_PATTBUF_PGVB1_Msk & ((value) << TCC_PATTBUF_PGVB1_Pos))
#define TCC_PATTBUF_PGVB2_Pos                 _U_(10)                                              /**< (TCC_PATTBUF) Pattern Generator 2 Output Enable Position */
#define TCC_PATTBUF_PGVB2_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB2_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 2 Output Enable Mask */
#define TCC_PATTBUF_PGVB2(value)              (TCC_PATTBUF_PGVB2_Msk & ((value) << TCC_PATTBUF_PGVB2_Pos))
#define TCC_PATTBUF_PGVB3_Pos                 _U_(11)                                              /**< (TCC_PATTBUF) Pattern Generator 3 Output Enable Position */
#define TCC_PATTBUF_PGVB3_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB3_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 3 Output Enable Mask */
#define TCC_PATTBUF_PGVB3(value)              (TCC_PATTBUF_PGVB3_Msk & ((value) << TCC_PATTBUF_PGVB3_Pos))
#define TCC_PATTBUF_PGVB4_Pos                 _U_(12)                                              /**< (TCC_PATTBUF) Pattern Generator 4 Output Enable Position */
#define TCC_PATTBUF_PGVB4_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB4_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 4 Output Enable Mask */
#define TCC_PATTBUF_PGVB4(value)              (TCC_PATTBUF_PGVB4_Msk & ((value) << TCC_PATTBUF_PGVB4_Pos))
#define TCC_PATTBUF_PGVB5_Pos                 _U_(13)                                              /**< (TCC_PATTBUF) Pattern Generator 5 Output Enable Position */
#define TCC_PATTBUF_PGVB5_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB5_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 5 Output Enable Mask */
#define TCC_PATTBUF_PGVB5(value)              (TCC_PATTBUF_PGVB5_Msk & ((value) << TCC_PATTBUF_PGVB5_Pos))
#define TCC_PATTBUF_PGVB6_Pos                 _U_(14)                                              /**< (TCC_PATTBUF) Pattern Generator 6 Output Enable Position */
#define TCC_PATTBUF_PGVB6_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB6_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 6 Output Enable Mask */
#define TCC_PATTBUF_PGVB6(value)              (TCC_PATTBUF_PGVB6_Msk & ((value) << TCC_PATTBUF_PGVB6_Pos))
#define TCC_PATTBUF_PGVB7_Pos                 _U_(15)                                              /**< (TCC_PATTBUF) Pattern Generator 7 Output Enable Position */
#define TCC_PATTBUF_PGVB7_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB7_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 7 Output Enable Mask */
#define TCC_PATTBUF_PGVB7(value)              (TCC_PATTBUF_PGVB7_Msk & ((value) << TCC_PATTBUF_PGVB7_Pos))
#define TCC_PATTBUF_Msk                       _U_(0xFFFF)                                          /**< (TCC_PATTBUF) Register Mask  */

#define TCC_PATTBUF_PGEB_Pos                  _U_(0)                                               /**< (TCC_PATTBUF Position) Pattern Generator x Output Enable Buffer */
#define TCC_PATTBUF_PGEB_Msk                  (_U_(0xFF) << TCC_PATTBUF_PGEB_Pos)                  /**< (TCC_PATTBUF Mask) PGEB */
#define TCC_PATTBUF_PGEB(value)               (TCC_PATTBUF_PGEB_Msk & ((value) << TCC_PATTBUF_PGEB_Pos)) 
#define TCC_PATTBUF_PGVB_Pos                  _U_(8)                                               /**< (TCC_PATTBUF Position) Pattern Generator 7 Output Enable */
#define TCC_PATTBUF_PGVB_Msk                  (_U_(0xFF) << TCC_PATTBUF_PGVB_Pos)                  /**< (TCC_PATTBUF Mask) PGVB */
#define TCC_PATTBUF_PGVB(value)               (TCC_PATTBUF_PGVB_Msk & ((value) << TCC_PATTBUF_PGVB_Pos)) 

/* -------- TCC_WAVEBUF : (TCC Offset: 0x68) (R/W 32) Waveform Control Buffer -------- */
#define TCC_WAVEBUF_RESETVALUE                _U_(0x00)                                            /**<  (TCC_WAVEBUF) Waveform Control Buffer  Reset Value */

#define TCC_WAVEBUF_WAVEGENB_Pos              _U_(0)                                               /**< (TCC_WAVEBUF) Waveform Generation Buffer Position */
#define TCC_WAVEBUF_WAVEGENB_Msk              (_U_(0x7) << TCC_WAVEBUF_WAVEGENB_Pos)               /**< (TCC_WAVEBUF) Waveform Generation Buffer Mask */
#define TCC_WAVEBUF_WAVEGENB(value)           (TCC_WAVEBUF_WAVEGENB_Msk & ((value) << TCC_WAVEBUF_WAVEGENB_Pos))
#define   TCC_WAVEBUF_WAVEGENB_NFRQ_Val       _U_(0x0)                                             /**< (TCC_WAVEBUF) Normal frequency  */
#define   TCC_WAVEBUF_WAVEGENB_MFRQ_Val       _U_(0x1)                                             /**< (TCC_WAVEBUF) Match frequency  */
#define   TCC_WAVEBUF_WAVEGENB_NPWM_Val       _U_(0x2)                                             /**< (TCC_WAVEBUF) Normal PWM  */
#define   TCC_WAVEBUF_WAVEGENB_DSCRITICAL_Val _U_(0x4)                                             /**< (TCC_WAVEBUF) Dual-slope critical  */
#define   TCC_WAVEBUF_WAVEGENB_DSBOTTOM_Val   _U_(0x5)                                             /**< (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches ZERO  */
#define   TCC_WAVEBUF_WAVEGENB_DSBOTH_Val     _U_(0x6)                                             /**< (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP  */
#define   TCC_WAVEBUF_WAVEGENB_DSTOP_Val      _U_(0x7)                                             /**< (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches TOP  */
#define TCC_WAVEBUF_WAVEGENB_NFRQ             (TCC_WAVEBUF_WAVEGENB_NFRQ_Val << TCC_WAVEBUF_WAVEGENB_Pos) /**< (TCC_WAVEBUF) Normal frequency Position  */
#define TCC_WAVEBUF_WAVEGENB_MFRQ             (TCC_WAVEBUF_WAVEGENB_MFRQ_Val << TCC_WAVEBUF_WAVEGENB_Pos) /**< (TCC_WAVEBUF) Match frequency Position  */
#define TCC_WAVEBUF_WAVEGENB_NPWM             (TCC_WAVEBUF_WAVEGENB_NPWM_Val << TCC_WAVEBUF_WAVEGENB_Pos) /**< (TCC_WAVEBUF) Normal PWM Position  */
#define TCC_WAVEBUF_WAVEGENB_DSCRITICAL       (TCC_WAVEBUF_WAVEGENB_DSCRITICAL_Val << TCC_WAVEBUF_WAVEGENB_Pos) /**< (TCC_WAVEBUF) Dual-slope critical Position  */
#define TCC_WAVEBUF_WAVEGENB_DSBOTTOM         (TCC_WAVEBUF_WAVEGENB_DSBOTTOM_Val << TCC_WAVEBUF_WAVEGENB_Pos) /**< (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches ZERO Position  */
#define TCC_WAVEBUF_WAVEGENB_DSBOTH           (TCC_WAVEBUF_WAVEGENB_DSBOTH_Val << TCC_WAVEBUF_WAVEGENB_Pos) /**< (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP Position  */
#define TCC_WAVEBUF_WAVEGENB_DSTOP            (TCC_WAVEBUF_WAVEGENB_DSTOP_Val << TCC_WAVEBUF_WAVEGENB_Pos) /**< (TCC_WAVEBUF) Dual-slope with interrupt/event condition when COUNT reaches TOP Position  */
#define TCC_WAVEBUF_RAMPB_Pos                 _U_(4)                                               /**< (TCC_WAVEBUF) Ramp Mode Buffer Position */
#define TCC_WAVEBUF_RAMPB_Msk                 (_U_(0x3) << TCC_WAVEBUF_RAMPB_Pos)                  /**< (TCC_WAVEBUF) Ramp Mode Buffer Mask */
#define TCC_WAVEBUF_RAMPB(value)              (TCC_WAVEBUF_RAMPB_Msk & ((value) << TCC_WAVEBUF_RAMPB_Pos))
#define TCC_WAVEBUF_CIPERENB_Pos              _U_(7)                                               /**< (TCC_WAVEBUF) Circular Period Enable Buffer Position */
#define TCC_WAVEBUF_CIPERENB_Msk              (_U_(0x1) << TCC_WAVEBUF_CIPERENB_Pos)               /**< (TCC_WAVEBUF) Circular Period Enable Buffer Mask */
#define TCC_WAVEBUF_CIPERENB(value)           (TCC_WAVEBUF_CIPERENB_Msk & ((value) << TCC_WAVEBUF_CIPERENB_Pos))
#define TCC_WAVEBUF_CICCENB0_Pos              _U_(8)                                               /**< (TCC_WAVEBUF) Circular Channel 0 Enable Buffer Position */
#define TCC_WAVEBUF_CICCENB0_Msk              (_U_(0x1) << TCC_WAVEBUF_CICCENB0_Pos)               /**< (TCC_WAVEBUF) Circular Channel 0 Enable Buffer Mask */
#define TCC_WAVEBUF_CICCENB0(value)           (TCC_WAVEBUF_CICCENB0_Msk & ((value) << TCC_WAVEBUF_CICCENB0_Pos))
#define TCC_WAVEBUF_CICCENB1_Pos              _U_(9)                                               /**< (TCC_WAVEBUF) Circular Channel 1 Enable Buffer Position */
#define TCC_WAVEBUF_CICCENB1_Msk              (_U_(0x1) << TCC_WAVEBUF_CICCENB1_Pos)               /**< (TCC_WAVEBUF) Circular Channel 1 Enable Buffer Mask */
#define TCC_WAVEBUF_CICCENB1(value)           (TCC_WAVEBUF_CICCENB1_Msk & ((value) << TCC_WAVEBUF_CICCENB1_Pos))
#define TCC_WAVEBUF_CICCENB2_Pos              _U_(10)                                              /**< (TCC_WAVEBUF) Circular Channel 2 Enable Buffer Position */
#define TCC_WAVEBUF_CICCENB2_Msk              (_U_(0x1) << TCC_WAVEBUF_CICCENB2_Pos)               /**< (TCC_WAVEBUF) Circular Channel 2 Enable Buffer Mask */
#define TCC_WAVEBUF_CICCENB2(value)           (TCC_WAVEBUF_CICCENB2_Msk & ((value) << TCC_WAVEBUF_CICCENB2_Pos))
#define TCC_WAVEBUF_CICCENB3_Pos              _U_(11)                                              /**< (TCC_WAVEBUF) Circular Channel 3 Enable Buffer Position */
#define TCC_WAVEBUF_CICCENB3_Msk              (_U_(0x1) << TCC_WAVEBUF_CICCENB3_Pos)               /**< (TCC_WAVEBUF) Circular Channel 3 Enable Buffer Mask */
#define TCC_WAVEBUF_CICCENB3(value)           (TCC_WAVEBUF_CICCENB3_Msk & ((value) << TCC_WAVEBUF_CICCENB3_Pos))
#define TCC_WAVEBUF_POLB0_Pos                 _U_(16)                                              /**< (TCC_WAVEBUF) Channel 0 Polarity Buffer Position */
#define TCC_WAVEBUF_POLB0_Msk                 (_U_(0x1) << TCC_WAVEBUF_POLB0_Pos)                  /**< (TCC_WAVEBUF) Channel 0 Polarity Buffer Mask */
#define TCC_WAVEBUF_POLB0(value)              (TCC_WAVEBUF_POLB0_Msk & ((value) << TCC_WAVEBUF_POLB0_Pos))
#define TCC_WAVEBUF_POLB1_Pos                 _U_(17)                                              /**< (TCC_WAVEBUF) Channel 1 Polarity Buffer Position */
#define TCC_WAVEBUF_POLB1_Msk                 (_U_(0x1) << TCC_WAVEBUF_POLB1_Pos)                  /**< (TCC_WAVEBUF) Channel 1 Polarity Buffer Mask */
#define TCC_WAVEBUF_POLB1(value)              (TCC_WAVEBUF_POLB1_Msk & ((value) << TCC_WAVEBUF_POLB1_Pos))
#define TCC_WAVEBUF_POLB2_Pos                 _U_(18)                                              /**< (TCC_WAVEBUF) Channel 2 Polarity Buffer Position */
#define TCC_WAVEBUF_POLB2_Msk                 (_U_(0x1) << TCC_WAVEBUF_POLB2_Pos)                  /**< (TCC_WAVEBUF) Channel 2 Polarity Buffer Mask */
#define TCC_WAVEBUF_POLB2(value)              (TCC_WAVEBUF_POLB2_Msk & ((value) << TCC_WAVEBUF_POLB2_Pos))
#define TCC_WAVEBUF_POLB3_Pos                 _U_(19)                                              /**< (TCC_WAVEBUF) Channel 3 Polarity Buffer Position */
#define TCC_WAVEBUF_POLB3_Msk                 (_U_(0x1) << TCC_WAVEBUF_POLB3_Pos)                  /**< (TCC_WAVEBUF) Channel 3 Polarity Buffer Mask */
#define TCC_WAVEBUF_POLB3(value)              (TCC_WAVEBUF_POLB3_Msk & ((value) << TCC_WAVEBUF_POLB3_Pos))
#define TCC_WAVEBUF_SWAPB0_Pos                _U_(24)                                              /**< (TCC_WAVEBUF) Swap DTI Output Pair 0 Buffer Position */
#define TCC_WAVEBUF_SWAPB0_Msk                (_U_(0x1) << TCC_WAVEBUF_SWAPB0_Pos)                 /**< (TCC_WAVEBUF) Swap DTI Output Pair 0 Buffer Mask */
#define TCC_WAVEBUF_SWAPB0(value)             (TCC_WAVEBUF_SWAPB0_Msk & ((value) << TCC_WAVEBUF_SWAPB0_Pos))
#define TCC_WAVEBUF_SWAPB1_Pos                _U_(25)                                              /**< (TCC_WAVEBUF) Swap DTI Output Pair 1 Buffer Position */
#define TCC_WAVEBUF_SWAPB1_Msk                (_U_(0x1) << TCC_WAVEBUF_SWAPB1_Pos)                 /**< (TCC_WAVEBUF) Swap DTI Output Pair 1 Buffer Mask */
#define TCC_WAVEBUF_SWAPB1(value)             (TCC_WAVEBUF_SWAPB1_Msk & ((value) << TCC_WAVEBUF_SWAPB1_Pos))
#define TCC_WAVEBUF_SWAPB2_Pos                _U_(26)                                              /**< (TCC_WAVEBUF) Swap DTI Output Pair 2 Buffer Position */
#define TCC_WAVEBUF_SWAPB2_Msk                (_U_(0x1) << TCC_WAVEBUF_SWAPB2_Pos)                 /**< (TCC_WAVEBUF) Swap DTI Output Pair 2 Buffer Mask */
#define TCC_WAVEBUF_SWAPB2(value)             (TCC_WAVEBUF_SWAPB2_Msk & ((value) << TCC_WAVEBUF_SWAPB2_Pos))
#define TCC_WAVEBUF_SWAPB3_Pos                _U_(27)                                              /**< (TCC_WAVEBUF) Swap DTI Output Pair 3 Buffer Position */
#define TCC_WAVEBUF_SWAPB3_Msk                (_U_(0x1) << TCC_WAVEBUF_SWAPB3_Pos)                 /**< (TCC_WAVEBUF) Swap DTI Output Pair 3 Buffer Mask */
#define TCC_WAVEBUF_SWAPB3(value)             (TCC_WAVEBUF_SWAPB3_Msk & ((value) << TCC_WAVEBUF_SWAPB3_Pos))
#define TCC_WAVEBUF_Msk                       _U_(0x0F0F0FB7)                                      /**< (TCC_WAVEBUF) Register Mask  */

