Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.0.33/saml21a1/include/component/tcc.h
#define TCC_WAVEBUF_CICCENB_Pos               _U_(8)                                               /**< (TCC_WAVEBUF Position) Circular Channel x Enable Buffer */
#define TCC_WAVEBUF_CICCENB_Msk               (_U_(0xF) << TCC_WAVEBUF_CICCENB_Pos)                /**< (TCC_WAVEBUF Mask) CICCENB */
#define TCC_WAVEBUF_CICCENB(value)            (TCC_WAVEBUF_CICCENB_Msk & ((value) << TCC_WAVEBUF_CICCENB_Pos)) 
#define TCC_WAVEBUF_POLB_Pos                  _U_(16)                                              /**< (TCC_WAVEBUF Position) Channel x Polarity Buffer */
#define TCC_WAVEBUF_POLB_Msk                  (_U_(0xF) << TCC_WAVEBUF_POLB_Pos)                   /**< (TCC_WAVEBUF Mask) POLB */
#define TCC_WAVEBUF_POLB(value)               (TCC_WAVEBUF_POLB_Msk & ((value) << TCC_WAVEBUF_POLB_Pos)) 
#define TCC_WAVEBUF_SWAPB_Pos                 _U_(24)                                              /**< (TCC_WAVEBUF Position) Swap DTI Output Pair 3 Buffer */
#define TCC_WAVEBUF_SWAPB_Msk                 (_U_(0xF) << TCC_WAVEBUF_SWAPB_Pos)                  /**< (TCC_WAVEBUF Mask) SWAPB */
#define TCC_WAVEBUF_SWAPB(value)              (TCC_WAVEBUF_SWAPB_Msk & ((value) << TCC_WAVEBUF_SWAPB_Pos)) 

/* -------- TCC_PERBUF : (TCC Offset: 0x6C) (R/W 32) Period Buffer -------- */
#define TCC_PERBUF_RESETVALUE                 _U_(0xFFFFFFFF)                                      /**<  (TCC_PERBUF) Period Buffer  Reset Value */

#define TCC_PERBUF_PERBUF_Pos                 _U_(0)                                               /**< (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_PERBUF_Msk                 (_U_(0xFFFFFF) << TCC_PERBUF_PERBUF_Pos)             /**< (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_PERBUF(value)              (TCC_PERBUF_PERBUF_Msk & ((value) << TCC_PERBUF_PERBUF_Pos))
#define TCC_PERBUF_Msk                        _U_(0x00FFFFFF)                                      /**< (TCC_PERBUF) Register Mask  */

/* DITH4 mode */
#define TCC_PERBUF_DITH4_DITHERBUF_Pos        _U_(0)                                               /**< (TCC_PERBUF) Dithering Buffer Cycle Number Position */
#define TCC_PERBUF_DITH4_DITHERBUF_Msk        (_U_(0xF) << TCC_PERBUF_DITH4_DITHERBUF_Pos)         /**< (TCC_PERBUF) Dithering Buffer Cycle Number Mask */
#define TCC_PERBUF_DITH4_DITHERBUF(value)     (TCC_PERBUF_DITH4_DITHERBUF_Msk & ((value) << TCC_PERBUF_DITH4_DITHERBUF_Pos))
#define TCC_PERBUF_DITH4_PERBUF_Pos           _U_(4)                                               /**< (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_DITH4_PERBUF_Msk           (_U_(0xFFFFF) << TCC_PERBUF_DITH4_PERBUF_Pos)        /**< (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_DITH4_PERBUF(value)        (TCC_PERBUF_DITH4_PERBUF_Msk & ((value) << TCC_PERBUF_DITH4_PERBUF_Pos))
#define TCC_PERBUF_DITH4_Msk                  _U_(0x00FFFFFF)                                       /**< (TCC_PERBUF_DITH4) Register Mask  */

/* DITH5 mode */
#define TCC_PERBUF_DITH5_DITHERBUF_Pos        _U_(0)                                               /**< (TCC_PERBUF) Dithering Buffer Cycle Number Position */
#define TCC_PERBUF_DITH5_DITHERBUF_Msk        (_U_(0x1F) << TCC_PERBUF_DITH5_DITHERBUF_Pos)        /**< (TCC_PERBUF) Dithering Buffer Cycle Number Mask */
#define TCC_PERBUF_DITH5_DITHERBUF(value)     (TCC_PERBUF_DITH5_DITHERBUF_Msk & ((value) << TCC_PERBUF_DITH5_DITHERBUF_Pos))
#define TCC_PERBUF_DITH5_PERBUF_Pos           _U_(5)                                               /**< (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_DITH5_PERBUF_Msk           (_U_(0x7FFFF) << TCC_PERBUF_DITH5_PERBUF_Pos)        /**< (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_DITH5_PERBUF(value)        (TCC_PERBUF_DITH5_PERBUF_Msk & ((value) << TCC_PERBUF_DITH5_PERBUF_Pos))
#define TCC_PERBUF_DITH5_Msk                  _U_(0x00FFFFFF)                                       /**< (TCC_PERBUF_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_PERBUF_DITH6_DITHERBUF_Pos        _U_(0)                                               /**< (TCC_PERBUF) Dithering Buffer Cycle Number Position */
#define TCC_PERBUF_DITH6_DITHERBUF_Msk        (_U_(0x3F) << TCC_PERBUF_DITH6_DITHERBUF_Pos)        /**< (TCC_PERBUF) Dithering Buffer Cycle Number Mask */
#define TCC_PERBUF_DITH6_DITHERBUF(value)     (TCC_PERBUF_DITH6_DITHERBUF_Msk & ((value) << TCC_PERBUF_DITH6_DITHERBUF_Pos))
#define TCC_PERBUF_DITH6_PERBUF_Pos           _U_(6)                                               /**< (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_DITH6_PERBUF_Msk           (_U_(0x3FFFF) << TCC_PERBUF_DITH6_PERBUF_Pos)        /**< (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_DITH6_PERBUF(value)        (TCC_PERBUF_DITH6_PERBUF_Msk & ((value) << TCC_PERBUF_DITH6_PERBUF_Pos))
#define TCC_PERBUF_DITH6_Msk                  _U_(0x00FFFFFF)                                       /**< (TCC_PERBUF_DITH6) Register Mask  */


/* -------- TCC_CCBUF : (TCC Offset: 0x70) (R/W 32) Compare and Capture Buffer -------- */
#define TCC_CCBUF_RESETVALUE                  _U_(0x00)                                            /**<  (TCC_CCBUF) Compare and Capture Buffer  Reset Value */

#define TCC_CCBUF_CCBUF_Pos                   _U_(0)                                               /**< (TCC_CCBUF) Channel Compare/Capture Buffer Value Position */
#define TCC_CCBUF_CCBUF_Msk                   (_U_(0xFFFFFF) << TCC_CCBUF_CCBUF_Pos)               /**< (TCC_CCBUF) Channel Compare/Capture Buffer Value Mask */
#define TCC_CCBUF_CCBUF(value)                (TCC_CCBUF_CCBUF_Msk & ((value) << TCC_CCBUF_CCBUF_Pos))
#define TCC_CCBUF_Msk                         _U_(0x00FFFFFF)                                      /**< (TCC_CCBUF) Register Mask  */

/* DITH4 mode */
#define TCC_CCBUF_DITH4_CCBUF_Pos             _U_(0)                                               /**< (TCC_CCBUF) Channel Compare/Capture Buffer Value Position */
#define TCC_CCBUF_DITH4_CCBUF_Msk             (_U_(0xF) << TCC_CCBUF_DITH4_CCBUF_Pos)              /**< (TCC_CCBUF) Channel Compare/Capture Buffer Value Mask */
#define TCC_CCBUF_DITH4_CCBUF(value)          (TCC_CCBUF_DITH4_CCBUF_Msk & ((value) << TCC_CCBUF_DITH4_CCBUF_Pos))
#define TCC_CCBUF_DITH4_DITHERBUF_Pos         _U_(4)                                               /**< (TCC_CCBUF) Dithering Buffer Cycle Number Position */
#define TCC_CCBUF_DITH4_DITHERBUF_Msk         (_U_(0xFFFFF) << TCC_CCBUF_DITH4_DITHERBUF_Pos)      /**< (TCC_CCBUF) Dithering Buffer Cycle Number Mask */
#define TCC_CCBUF_DITH4_DITHERBUF(value)      (TCC_CCBUF_DITH4_DITHERBUF_Msk & ((value) << TCC_CCBUF_DITH4_DITHERBUF_Pos))
#define TCC_CCBUF_DITH4_Msk                   _U_(0x00FFFFFF)                                       /**< (TCC_CCBUF_DITH4) Register Mask  */

